app/Services/AdminLoginService.php

select * from `sp_admins` where `email` = 'admin@demo.com' or `username` = 'admin@demo.com' limit 1
---
    public function validateData($request)
    {
        $fieldType = filter_var($request->email, FILTER_VALIDATE_EMAIL) ? 'email' : 'username';

        $data = [$fieldType => $request->email, 'password' => $request->password];

        $admin = Admin::where('email', $request->email)->orWhere('username', $request->email)->first();