app/Services/AdminUserService.php

select * from `sp_users` where `sp_users`.`id` = '1' limit 1
delete from `sp_admin_users` where `user_id` = 1
insert into `sp_admin_users` (`admin_id`, `user_id`, `updated_at`, `created_at`) values ('3', 1, '2023-12-21 16:34:50', '2023-12-21 16:34:50')
---
    public function update($request)
    {
        $user = User::find($request->user);



        $data = [
            'country' => $request->country,
            'city' => $request->city,
            'zip' => $request->zip,
            'state' => $request->state,
        ];


        AdminUser::where('user_id', $user->id)->delete();

        foreach ($request->admins as $key => $value) {
            AdminUser::create([
                'admin_id' => $value,
                'user_id' => $user->id
            ]);