app/Services/UserLogin.php

select * from `sp_users` where `email` = 'dev@mail.com' limit 1
insert into `sp_user_logs` (`user_id`, `browser`, `system`, `country`, `ip`, `updated_at`, `created_at`) values (1, 'Chrome', 'Windows', '', '', '2023-12-05 09:05:56', '2023-12-05 09:05:56')
---
    public function login($request)
    {
        $user = User::where('email', $request->email)->first();

        if (!$user) {
            return ['type' => 'error', 'message' => 'No user found associated with this email'];
        }

        if (Auth::attempt($request->except('g-recaptcha-response', '_token'))) {

            $ip = request()->ip();
            $currentUserInfo = Location::get($ip);

            $browser = new Browser();
            $os = new Os();

            UserLog::create([
                'user_id' => auth()->id(),
                'browser' => $browser->getName(),
                'system' => $os->getName(),
                'country' => $currentUserInfo->countryName ?? '',
                'ip' => $currentUserInfo->ip ?? '',
            ]);