app/Services/UserDashboardService.php

    public function dashboard()
    {
        $user = auth()->user();

        $userAcounts = Account::where('user_id', $user->id)->get()->toArray();
---
select * from `sp_accounts` where `user_id` = 1