app/Http/Requests/AdminUserRequest.php

    public function rules()
    {

        $user = User::find(request()->user);
---
select * from `sp_users` where `sp_users`.`id` = '1' limit 1