app/Http/Requests/UserLoginRequest.php

select * from `sp_configurations` limit 1
---
    public function rules()
    {
        $general  = Configuration::first();