app/Helpers/Helper.php

    public static function languageSelection($code)
    {
        $default = Language::where('status', 0)->first()->code;
---
select * from `sp_languages` where `status` = 0 limit 1

    public static function config()
    {
        return Configuration::first();
---
select * from `sp_configurations` limit 1

    public static function languages()
    {
        return Language::latest()->get();
---
select * from `sp_languages` order by `created_at` desc

    public static function pages()
    {
        return Page::where('status', 1)->where('name', '!=', 'home')->get();
---
select * from `sp_pages` where `status` = 1 and `name` != 'home'

    public static function sidebarData()
    {
        $data['deactiveUser'] = User::where('status', 0)->count();
        $data['emailUnverified'] = User::where('is_email_verified', 0)->count();
        $data['smsUnverified'] = User::where('is_sms_verified', 0)->count();
        $data['kycUnverified'] = User::whereIn('is_kyc_verified', [0, 2])->count();
        $data['kyc_req'] = User::where('is_kyc_verified', 2)->where('kyc_information', '!=', null)->count();

        $data['pendingTicket'] = Ticket::where('status', 2)->count();

        $data['pendingWithdraw'] = Withdraw::where('status', 0)->count();
---
select count(*) as aggregate from `sp_users` where `status` = 0
select count(*) as aggregate from `sp_users` where `is_email_verified` = 0
select count(*) as aggregate from `sp_users` where `is_sms_verified` = 0
select count(*) as aggregate from `sp_users` where `is_kyc_verified` in (0, 2)
select count(*) as aggregate from `sp_users` where `is_kyc_verified` = 2 and `kyc_information` is not null
select count(*) as aggregate from `sp_tickets` where `status` = 2
select count(*) as aggregate from `sp_withdraws` where `status` = 0

    public static function theme()
    {
        return 'frontend.' . Configuration::first()->theme . '.';
---
select * from `sp_configurations` limit 1

    public static function builder($section, $collection = false)
    {

        if ($collection) {
            return Content::where('type', 'iteratable')->where('theme', self::config()->theme)->where('name', $section)->get();
        }

        return Content::where('type', 'non_iteratable')->where('theme', self::config()->theme)->where('name', $section)->first();
---
select * from `sp_contents` where `type` = 'iteratable' and `theme` = 'light' and `name` = 'socials'
select * from `sp_contents` where `type` = 'non_iteratable' and `theme` = 'light' and `name` = 'contact' limit 1

    public static function navbarMenus()
    {
        $dropdowns = Page::where('name', '!=', 'home')->where('is_dropdown', true)->where('status', 1)->orderBy('order', 'ASC')->get();

        $nonDropdowns = Page::where('name', '!=', 'home')->where('is_dropdown', false)->where('status', 1)->orderBy('order', 'ASC')->get();
---
select * from `sp_pages` where `name` != 'home' and `is_dropdown` = 1 and `status` = 1 order by `order` asc
select * from `sp_pages` where `name` != 'home' and `is_dropdown` = 0 and `status` = 1 order by `order` asc