app/Services/MT5/MT5Service.php

select `login` from `sp_accounts` where `user_id` = 1
---
    public function getAccountDetailsMany()
    {
        $id = $this->getToken();

        $userAccounts = Account::where('user_id', Auth::id())->get('login')->toArray();