app/Http/Controllers/FrontendController.php

    public function index()
    {


        $data['page'] = Page::where('name', 'home')->first();
---
select * from `sp_pages` where `name` = 'home' limit 1

    public function page(Request $request)
    {
        $data['page'] = Page::where('slug', $request->pages)->first();
---
select * from `sp_pages` where `slug` = 'serviceworker.js' limit 1