app/Http/Controllers/TicketController.php

select * from `sp_ticket_replies` where `sp_ticket_replies`.`ticket_id` in (1)
select * from `sp_tickets` where `user_id` = 1 limit 15 offset 0
select count(*) as aggregate from `sp_tickets` where `user_id` = 1
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = '2'
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = '3'
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = '1'
---
    public function index()
    {
        $data['title'] = "Support Ticket";
        $data['tickets'] = Ticket::whereUserId(Auth::user()->id)->with('ticketReplies')->paginate();
        $data['tickets_pending'] = Ticket::whereUserId(Auth::user()->id)->whereStatus('2')->count();
        $data['tickets_answered'] = Ticket::whereUserId(Auth::user()->id)->whereStatus('3')->count();
        $data['tickets_closed'] = Ticket::whereUserId(Auth::user()->id)->whereStatus('1')->count();
        $data['tickets_all'] = Ticket::whereUserId(Auth::user()->id)->count();

select * from `sp_ticket_replies` where `sp_ticket_replies`.`ticket_id` in (1)
select * from `sp_tickets` where `user_id` = 1 and `status` = 2 limit 15 offset 0
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = 2
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = '2'
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = '3'
select count(*) as aggregate from `sp_tickets` where `user_id` = 1 and `status` = '1'
select count(*) as aggregate from `sp_tickets` where `user_id` = 1
---
    public function ticketStatus(Request $request)
    {
        $ticketStatus = [
            'answered' => 3,
            'pending' => 2,
            'closed' => 1
        ];

        $data['title'] = "{$request->status} Support Ticket";

        $data['tickets'] = Ticket::whereUserId(Auth::user()->id)->whereStatus($ticketStatus[$request->status])->with('ticketReplies')->paginate();

        $data['tickets_pending'] = Ticket::whereUserId(Auth::user()->id)->whereStatus('2')->count();
        $data['tickets_answered'] = Ticket::whereUserId(Auth::user()->id)->whereStatus('3')->count();
        $data['tickets_closed'] = Ticket::whereUserId(Auth::user()->id)->whereStatus('1')->count();
        $data['tickets_all'] = Ticket::whereUserId(Auth::user()->id)->count();