app/Http/Controllers/UserController.php

select * from `sp_accounts` where `sp_accounts`.`user_id` = 1 and `sp_accounts`.`user_id` is not null
---
    public function openAccount(Request $request)
    {

        $data['title'] = "Open Account";

        $data['isDemo'] = false;
        if ($request->acc == 'demoacc') {
            $data['isDemo'] = true;
        }


        if ($request->all()) {



            $this->dashboard->openAccount($request->leverage, $request->investor_pass, $request->master_pass);

            // Account::create([
            //     ''
            // ]);

        }

        return view(Helper::theme() . 'user.open_account')->with($data);

select * from `sp_payment_methods` where `status` = 1
insert into `sp_deposits` (`user_id`, `payment_method_id`, `amount`, `login`, `status`, `updated_at`, `created_at`) values (1, '3', '2323', '1', 2, '2023-12-01 06:58:20', '2023-12-01 06:58:20')
select * from `sp_accounts` where `sp_accounts`.`user_id` = 1 and `sp_accounts`.`user_id` is not null
---
    public function deposit(Request $request)
    {

        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['title'] = "Deposit";
        $data['payment_methods'] = PaymentMethod::where('status', 1)->get()->toArray();

        if ($request->all()) {

            $request->validate([
                'payment_method_id' => 'required',
                'amount' => 'required',
                'login' => 'required',
            ]);

            Deposit::create([
                'user_id' => Auth::id(),
                'payment_method_id' => $request->payment_method_id,
                'amount' => $request->amount,
                'login' => $request->login,
                'status' => 2
            ]);

            session()->flash('success', 'Deposit request sent successfully!');

            return redirect('/history');
        }


        return view(Helper::theme() . 'user.deposit')->with($data);

select * from `sp_deposits` where `user_id` = 1
---
    public function createDeposit()
    {
        $user = auth()->user();



        return view(Helper::theme() . 'user.deposit')->with($data);

select * from `sp_user_payment_methods` where `status` = 1
select * from `sp_accounts` where `sp_accounts`.`user_id` = 1 and `sp_accounts`.`user_id` is not null
---
    public function withdraw(Request $request)
    {
        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['payment_methods'] = UserPaymentMethod::where('status', 1)->get()->toArray();
        $data['title'] = 'Withdraw';


        if ($request->all()) {

            $request->validate([
                'payment_method_id' => 'required',
                'amount' => 'required',
                'login' => 'required',
            ]);

            Withdraw::create([
                'user_id' => Auth::id(),
                'payment_method_id' => $request->payment_method_id,
                'amount' => $request->amount,
                'login' => $request->login,
                'status' => 2
            ]);

            session()->flash('success', 'Withdraw request sent successfully!');

            return redirect('/history');
        }

        return view(Helper::theme() . 'user.withdraw.index')->with($data);

select * from `sp_deposits` where `user_id` = 1 and `login` = '123456' limit 10 offset 0
select * from `sp_withdraws` where `user_id` = 1 limit 10 offset 0
select count(*) as aggregate from `sp_deposits` where `user_id` = 1 and `login` = '123456'
select count(*) as aggregate from `sp_withdraws` where `user_id` = 1
select * from `sp_accounts` where `sp_accounts`.`user_id` = 1 and `sp_accounts`.`user_id` is not null
---
    public function history(Request $request)
    {
        $data['title'] = 'History';

        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['login'] = '';

        if ($request->type == 'with') {
            $query = Withdraw::where('user_id', Auth::id());
            $data['type'] = 'with';
        }
        if ($request->type == 'dep' || $request->type == '') {
            $query = Deposit::where('user_id', Auth::id());
            $data['type'] = 'dep';
        }

        if ($request->login) {

            $query =  $query->where('login', $request->login);
            $data['login'] = $request->login;
        }

        $query =  $query->with('payment');
        $query =  $query->paginate(10);
        $data['requests'] = $query;



        return view(Helper::theme() . 'user.history')->with($data);