app/Http/Controllers/UserController.php

select * from `sp_payment_methods` where `status` = 1
---
    public function deposit(Request $request)
    {

        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['title'] = "Deposit";
        $data['payment_methods'] = PaymentMethod::where('status', 1)->get()->toArray();

select * from `sp_user_payment_methods` where `status` = 1
---
    public function withdraw(Request $request)
    {

        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['payment_methods'] = UserPaymentMethod::where('status', 1)->get()->toArray();

select * from `sp_deposits` where `user_id` = 6 limit 10 offset 0
select * from `sp_withdraws` where `user_id` = 6 limit 10 offset 0
select count(*) as aggregate from `sp_deposits` where `user_id` = 6
select count(*) as aggregate from `sp_withdraws` where `user_id` = 6
---
    public function history(Request $request)
    {
        $data['title'] = 'History';

        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['login'] = '';

        if ($request->type == 'with') {
            $query = Withdraw::where('user_id', Auth::id());
            $data['type'] = 'with';
        }
        if ($request->type == 'dep' || $request->type == '') {
            $query = Deposit::where('user_id', Auth::id());
            $data['type'] = 'dep';
        }

        if ($request->login) {

            $query =  $query->where('login', $request->login);
            $data['login'] = $request->login;
        }

        $query =  $query->with('payment');
        $query =  $query->paginate(10);