app/Http/Controllers/UserController.php

select * from `sp_payment_methods` where `status` = 1
---
    public function deposit(Request $request)
    {

        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['title'] = "Deposit";
        $data['payment_methods'] = PaymentMethod::where('status', 1)->get()->toArray();

select * from `sp_accounts` where `sp_accounts`.`user_id` = 1 and `sp_accounts`.`user_id` is not null
---
    public function withdraw()
    {
        $user = auth()->user();
        $data['accounts'] = $user->accounts;
        $data['title'] = 'Withdraw';

        return view(Helper::theme() . 'user.withdraw.index')->with($data);