app/Http/Controllers/UserPaymentMethodsController.php

    public function index()
    {
        $data['title'] = "Payment Method";
        $data['p_methods'] = UserPaymentMethod::whereUserId(Auth::user()->id)->paginate(10);
---
select * from `sp_user_payment_methods` where `user_id` = 1 limit 10 offset 0
select count(*) as aggregate from `sp_user_payment_methods` where `user_id` = 1

    public function update(Request $request, $id)
    {

        $method = UserPaymentMethod::findOrFail($id);
---
select * from `sp_user_payment_methods` where `sp_user_payment_methods`.`id` = '1' limit 1