app/Http/Controllers/Backend/AdminController.php

    public function index(Request $request)
    {
        $data['title'] = 'Manage Admins';

        $data['admins'] = Admin::when($request->search, function ($admin) use ($request) {
            $admin->where(function ($item) use ($request) {

                $item->where('username', $request->search)
                    ->orWhere('email', $request->search);
            });
        })->where('username', '!=', 'admin')->latest()->with('roles')->paginate(Helper::pagination());
---
select count(*) as aggregate from `sp_admins` where `username` != 'admin'