app/Http/Controllers/Backend/DashboardController.php

        $data['deposits'] = Deposit::where('status', 1)->latest()->with('user')->limit(4)->get();
        $data['withdraws'] = Withdraw::where('status', 1)->latest()->with('user', 'withdrawMethod')->limit(4)->get();

        $accounts = Account::select(DB::raw('MONTHNAME(created_at) month'))
            ->groupby('month')
            ->get();;
---
select count(*) as aggregate from `sp_accounts`