app/Http/Controllers/Backend/ManageUserController.php

    public function index(Request $request)
    {
        $data['title'] = 'All Users';

        $user = User::query();

        if ($request->search) {
            $user->where(function ($item) use ($request) {
                $item->where('username', $request->search)
                    ->orWhere('email', $request->email)
                    ->orWhere('phone', $request->search);
            });
        }

        if ($request->user_status) {
            $status = $request->user_status === 'user_active' ? 1 : 0;
            $user->where('status', $status);
        }


        $data['users'] = $user->latest()->paginate(Helper::pagination());
---
select * from `sp_users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sp_users`

    public function userDetails(Request $request)
    {



        $data['user'] = User::with('refferals')->where('id', $request->user)->firstOrFail();
---
select * from `sp_users` where `sp_users`.`ref_id` in (1)

    public function userStatusWiseFilter(Request $request)
    {

        $data['title'] = ucwords($request->status) . ' Users';
        $users = User::query();
        if ($request->search) {
            $users->where(function ($item) use ($request) {
                $item->where('username', $request->search)
                    ->orWhere('email', $request->email)
                    ->orWhere('phone', $request->search);
            });
        }
        if ($request->user_status) {
            $status = $request->user_status === 'user_active' ? 1 : 0;
            $users->where('status', $status);
        }

        if ($request->status == 'active') {
            $users->where('status', 1);
        } elseif ($request->status == 'deactive') {
            $users->where('status', 0);
        } elseif ($request->status === 'email-unverified') {
            $users->where('is_email_verified', 0);
        } elseif ($request->status === 'sms-unverified') {
            $users->where('is_sms_verified', 0);
        } elseif ($request->status === 'kyc-unverified') {
            $users->whereIn('is_kyc_verified', [0, 2]);
        }


        $data['users'] = $users->paginate(Helper::pagination());
---
select * from `sp_users` where `is_kyc_verified` in (0, 2) limit 10 offset 0
select count(*) as aggregate from `sp_users` where `is_kyc_verified` in (0, 2)

    public function kycStatus(Request $req)
    {

        //dd($req->all());
        $user = User::findOrFail($req->user_id);

        foreach ($req->docs as $id) {
            KycDocs::where('user_id', $user->id)
                ->where('id', $id)
                ->update([
                    'status' => 1
                ]);
---
select * from `sp_kyc_docs` where `sp_kyc_docs`.`user_id` in (1)

    public function bulkMail(Request $request)
    {
        $data = $request->validate([
            'subject' => 'required',
            'message' => 'required'
        ]);

        SendEmailJob::dispatch($data);

        return redirect()->route('admin.user.index')->with('success', 'Successfully Send Mail');
---
select * from `sp_users` where `id` = '1' limit 1

    public function userEdit(Request $request)
    {
        $data['user'] = User::with('refferals')->where('id', $request->user)->firstOrFail();

        $data['payment'] = Payment::where('user_id', $data['user']->id)->where('status', 1)->latest()->first();

        $data['totalRef'] = $data['user']->refferals->count();

        $data['userCommission'] = $data['user']->commissions->sum('amount');

        $data['withdrawTotal'] = Withdraw::where('user_id', $data['user']->id)->where('status', 1)->sum('amount');

        $data['totalDeposit'] = $data['user']->deposits()->where('status', 1)->sum('amount');

        $data['totalInvest'] = $data['user']->payments()->where('status', 1)->sum('amount');

        $data['totalTicket'] = $data['user']->tickets->count();


        $data['admins'] = Admin::whereNull('type')->select('id', 'username')->pluck('username', 'id')->toArray();
        //  dd($data['admins']);>
        $data['admin_users'] = AdminUser::where('user_id', $data['user']->id)->pluck('user_id', 'admin_id')->toArray();
---
select * from `sp_users` where `sp_users`.`ref_id` in (1)
select * from `sp_payments` where `user_id` = 1 and `status` = 1 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `sp_withdraws` where `user_id` = 1 and `status` = 1
select sum(`amount`) as aggregate from `sp_deposits` where `sp_deposits`.`user_id` = 1 and `sp_deposits`.`user_id` is not null and `status` = 1
select sum(`amount`) as aggregate from `sp_payments` where `sp_payments`.`user_id` = 1 and `sp_payments`.`user_id` is not null and `status` = 1
select `id`, `username` from `sp_admins` where `type` is null
select `user_id`, `admin_id` from `sp_admin_users` where `user_id` = 1