app/Http/Controllers/Backend/ManageUserController.php

select * from `sp_admins` where `sp_admins`.`id` = 1 limit 1
---
    public function index(Request $request)
    {

        $data['title'] = 'Wallets/Leads';

        $admin  = Admin::find(session()->get('user_id'));

select * from `sp_users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sp_users`
select `id`, `username` from `sp_admins` where `type` is null
---



        $data['users'] = $users->with('payment')->latest()->paginate(Helper::pagination());
        //  dd($data);
        $data['admins'] = Admin::whereNull('type')->select('id', 'username')->pluck('username', 'id')->toArray();

select * from `sp_users` where `sp_users`.`ref_id` in (1)
select * from `sp_payments` where `user_id` = 1 and `status` = 1 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `sp_withdraws` where `user_id` = 1 and `status` = 1
select sum(`amount`) as aggregate from `sp_deposits` where `sp_deposits`.`user_id` = 1 and `sp_deposits`.`user_id` is not null and `status` = 1
select sum(`amount`) as aggregate from `sp_payments` where `sp_payments`.`user_id` = 1 and `sp_payments`.`user_id` is not null and `status` = 1
select `id`, `username` from `sp_admins` where `type` is null
select `user_id`, `admin_id` from `sp_admin_users` where `user_id` = 1
---
    public function userEdit(Request $request)
    {
        $data['user'] = User::with('refferals')->where('id', $request->user)->firstOrFail();

        $data['payment'] = Payment::where('user_id', $data['user']->id)->where('status', 1)->latest()->first();

        $data['totalRef'] = $data['user']->refferals->count();

        $data['userCommission'] = $data['user']->commissions->sum('amount');

        $data['withdrawTotal'] = Withdraw::where('user_id', $data['user']->id)->where('status', 1)->sum('amount');

        $data['totalDeposit'] = $data['user']->deposits()->where('status', 1)->sum('amount');

        $data['totalInvest'] = $data['user']->payments()->where('status', 1)->sum('amount');

        $data['totalTicket'] = $data['user']->tickets->count();


        $data['admins'] = Admin::whereNull('type')->select('id', 'username')->pluck('username', 'id')->toArray();
        //  dd($data['admins']);>
        $data['admin_users'] = AdminUser::where('user_id', $data['user']->id)->pluck('user_id', 'admin_id')->toArray();