app/Http/Controllers/Backend/ManageDepositController.php

        //     $deposit->where('type', $type);
        // }

        $data['deposits'] = $deposit->with(
            'payment',
            'user'
        )->latest()->paginate(Helper::pagination());
---
select * from `sp_deposits` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sp_deposits`
select * from `sp_users` where `sp_users`.`id` in (1)


        $data['title'] = 'Manage Deposits';

        return view('backend.deposit.index')->with($data);
---
select * from `sp_deposits` where `id` = '10' limit 1