app/Http/Controllers/Backend/ManageWithdrawController.php

    public function index(Request $request)
    {
        $data['title'] = 'Withdraw Methods';

        $search = $request->search;

        $data['withdraws'] = Withdraw::when($search, function ($q) use ($search) {
            $q->where('name', 'LIKE', '%' . $search . '%');
        })->latest()->paginate(Helper::pagination());
---
select * from `sp_withdraws` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sp_withdraws`