app/Http/Controllers/Backend/PaymentMethodController.php

    public function index(Request $request)
    {

        $data['title'] = 'Manage Payment Methods';
        $data['payment_methods'] = PaymentMethod::search($request->search)
            ->latest()->paginate(Helper::pagination());
---
select * from `sp_payment_methods` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sp_payment_methods`