app/Http/Controllers/Backend/TransactionController.php

select * from `sp_accounts` where `sp_accounts`.`user_id` in (1, 6)
select * from `sp_users` limit 10 offset 0
select count(*) as aggregate from `sp_users`
---
    public function trans()
    {

        $data['title'] = 'Transaction';

        $data['users'] = User::with('accounts')->paginate(10);

insert into `sp_deposits` (`user_id`, `payment_method_id`, `amount`, `login`, `status`, `updated_at`, `created_at`) values ('1', 1, '100', '575021245', 1, '2023-12-14 16:37:35', '2023-12-14 16:37:35')
select * from `sp_deposits` where `id` = 8 limit 1
update `sp_users` set `balance` = 16498, `sp_users`.`updated_at` = '2023-12-14 16:37:35' where `id` = 1
---
    public function storeTrans(Request $request)
    {


        // dd($request->transac_type);
        if ($request->transac_type == 'dep') {

            $dep = Deposit::create([
                'user_id' => $request->user_id,
                'payment_method_id' => 1,
                'amount' => $request->amount,
                'login' => $request->login,
                'status' => 1
            ]);


            $deposit = Deposit::where('id', $dep->id)->firstOrFail();

            // $general = Configuration::first();

            // $gateway = Gateway::find($deposit->gateway_id);

            $deposit->user->balance = $deposit->user->balance + $deposit->amount;

            $deposit->user->save();